<template>
	<div id='blog'>
		<div class="blog_bg">
			<img :src="bgsrc" alt="">
		</div>
		<!-- 我的博客 -->
		<div class="blog_box">
			<div class="blog_cont">
				<div v-if="b_type=='全部博客'">
					<div v-for="(i,$index) in b_arr" v-if="$index<num" style="margin:10px;border-bottom:1px #ccc solid;">
						<div>
							<div style="padding-top:10px;padding-bottom:10px;font-weight:normal;color:#666666;line-height:16px; vertical-align: top; text-align:left;width:100%; ">
								{{i.title}}
							</div>
							<div style="padding-top:3px;color:#bcbcbc;font-size:12px;line-height:12px;margin:10px 0;">
								<span style="vertical-align: bottom;">发布日期{{i.time}} &nbsp;&nbsp;&nbsp;分类：{{i.type}}</span>
							</div>
							<div style="color:#898989;font-size:12px;font-family:微软雅黑;line-height:20px;padding-top:3px;padding-bottom:10px;">
								{{i.cont}}
							</div>
						</div>
					</div>
					<button class="morebtn" @click="moreBtn()">查看更多</button>
				</div>
				<div v-else>
					<div v-if="i.type == b_type" v-for="i in b_arr" style="margin:10px 20px;border-bottom:1px #ccc solid;">
						<div>
							<div style="padding-top:10px;padding-bottom:10px;font-weight:normal;color:#666666;line-height:16px; vertical-align: top; text-align:left;width:100%; ">
								{{i.title}}
							</div>
							<div style="padding-top:3px;color:#bcbcbc;font-size:12px;line-height:12px;margin:10px 0;">
								<span style="vertical-align: bottom;">发布日期{{i.time}} &nbsp;&nbsp;&nbsp;分类：{{i.type}}</span>
							</div>
							<div style="color:#898989;font-size:12px;font-family:微软雅黑;line-height:20px;padding-top:3px;padding-bottom:10px;">
								{{i.cont}}
							</div>
						</div>
					</div>
				</div>
			</div>
			<div class="blog_class">
				<div v-for="i in b_name" @click="b_type=i">{{i}}</div>
			</div>
		</div>
	</div>
</template>

<script>
	export default {
		methods: {
			moreBtn() {
				var obtn=document.querySelector('.morebtn')
				this.num+=5
				console.log(this.num)
				if(this.num>=20){
					obtn.style.display='none'
				}
			}
		},
		data() {
			return {
				num: 5,
				bgsrc: 'https://ccdn.goodq.top/caches/1f6a588ef8d15139fc379ea62fde10d4/aHR0cDovLzU2OWM4NGI5Y2I0NTMudDc0LnFpZmVpeWUuY29tL3FmeS1jb250ZW50L3VwbG9hZHMvMjAxNi8wMS82M2YzZGQ2ZTBhMTA5ZDI2ZDQxYjk2YzM2YTU3NDlhNi5qcGc_p_p100_p_3D.jpg',
				b_type: '全部博客',
				b_name: ['全部博客', '博客分类一', '博客分类二', '博客分类三', '博客分类四', '博客分类五'],
				b_arr: [{
						title: '旅行日记#20',
						time: '2016-01-19',
						type: '博客分类四',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#19',
						time: '2016-01-19',
						type: '博客分类四',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#18',
						time: '2016-01-19',
						type: '博客分类四',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#17',
						time: '2016-01-19',
						type: '博客分类四',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#16',
						time: '2016-01-19',
						type: '博客分类五',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#15',
						time: '2016-01-19',
						type: '博客分类五',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#14',
						time: '2016-01-19',
						type: '博客分类五',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#13',
						time: '2016-01-19',
						type: '博客分类五',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#12',
						time: '2016-01-19',
						type: '博客分类二',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#10',
						time: '2016-01-19',
						type: '博客分类二',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#9',
						time: '2016-01-19',
						type: '博客分类二',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#8',
						time: '2016-01-19',
						type: '博客分类三',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#7',
						time: '2016-01-19',
						type: '博客分类三',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#6',
						time: '2016-01-19',
						type: '博客分类三',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#5',
						time: '2016-01-19',
						type: '博客分类三',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#4',
						time: '2016-01-19',
						type: '博客分类一',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#3',
						time: '2016-01-19',
						type: '博客分类一',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#2',
						time: '2016-01-19',
						type: '博客分类一',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
					{
						title: '旅行日记#1',
						time: '2016-01-19',
						type: '博客分类一',
						cont: '藝術可遇不可求--它不會因為你是平民而對你視若無睹，也不會因為你是王公而對你青眼有加。天時未到，即使是最睿智的人也不能使藝術品誕生。夳夵壱売壳圢圤圥圦圧圩圪咍，壱売壳圢圤怅怆怐，怗怘怙怚怛怞怟怡怢怣怤怦怩怭夳夵壱売壳圢圤圥夲夳夵壱売壳。恀夳夵壱売壳圢圤圥夲夳夵壱売壳恍恎恏。恒恔恖恘恙恜恧恬恺，恽夳夵壱売壳圢圤圥夲夳夵壱売壳。夲夳夵壱売壳圢圤圥夲夳夵壱売壳.'
					},
				]
			}
		}
	}
</script>

<style>
	#blog {
		padding: 20px 40px 40px 40px;
	}

	.blog_bg {
		width: 100%;
		height: 340px;
	}

	.blog_bg img {
		width: 100%;
		height: 100%;
	}

	.blog_box {
		min-height: 400px;
		margin: 20px auto;
		display: flex;
	}

	.blog_cont {
		flex: 10;
		height: 880px;
		overflow-y: auto;
	}

	.blog_class {
		flex: 2;
		border-left: 1px #ccc dotted;
	}

	.blog_class>div {
		text-align: center;
		overflow: hidden;
		text-overflow: ellipsis;
		white-space: nowrap;
		max-width: 100%;
		font-size: 14px;
		font-weight: normal;
		font-style: normal;
		line-height: 36px;
	}
	.morebtn{
		display: block;
		margin: 20px auto;
		width:100px;
		height:40px;
		text-align: center;
		line-height:40px;
		outline: none;
		border:1px #ccc solid;
		cursor: pointer;
	}
</style>
